import HeroSection from "../components/HeroSection";
import MatalbCard from "../components/MatalbCard";
import HeroImg1 from "../assets/herosec.png";
import mbhsimg from "../assets/mbhsimg.jpeg";
import tahary from "../assets/videos/tahary.mp4";
import React from "react";
import Video1 from "../assets/videos/ved1.mp4";
import QuranAyah from "../components/QuranAyah";
import VedSection from "../components/VideoSection";
import { image } from "framer-motion/client";

function Mubahith3() {
  return (
    <div
      className="bg-gradient-to-b from-gray-900 via-gray-800 to-gray-900 min-h-screen text-white"
      dir="rtl"
    >
      {/* HERO SECTION */}
      <HeroSection />

      {/* المبحث: مطالب المبحث الثالث */}
      <section className="max-w-6xl mx-auto px-6 py-12 grid grid-cols-1 md:grid-cols-2 lg:grid-cols-1 gap-6">
        <h2 className="text-3xl md:text-4xl  text-center font-bold text-white z-10 px-6">
          أمثلة عن جهود الإدارة العامة والأقسام الجغرافية بمديريات الأمن
        </h2>
        <QuranAyah
          text={`بسم الله الرحمن الرحيم


        ﴿إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَابِ ذِي الْقُرْبَى وَيَنْهَى عَنِ الْفَحْشَاءِ وَالْمُنكَرِ وَالْبَغْيِ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ﴾`}
          speed={45}
          className="mt-10 mb-10 max-w-5xl mx-auto px-6"
        />
        {/* المطلب الأول */}
        <MatalbCard
          title="المطلب الأول: ماهية جرائم الأموال العامة"
          sections={[
            {
              title: "أولاً: تعريف جرائم الأموال العامة",
              content:
                "هي كل فعل يُشكّل اعتداءً على المال العام سواء بالاستيلاء أو الإتلاف أو الإضرار، سواء ارتكبه موظف عام أو مدني. يتسع نطاق هذا التعريف ليشمل الجرائم الموصوفة قانوناً والأفعال التي تضر بالمصلحة العامة وإن لم تُجرَّم صراحةً.",
            },
            {
              title: "ثانياً: خصائص الجرائم المالية",
              content:
                "تتسم بالتعقيد والخفاء وصعوبة الإثبات وتعدد المتهمين، وكثيراً ما تُرتكب بأساليب منهجية محكمة التخطيط. تستلزم هذه الخصائص كفاءات متخصصة في التحليل المالي والجنائي الرقمي وتعاوناً مؤسسياً موسعاً لكشفها.",
            },
            {
              title: "ثالثاً: صور جرائم الأموال العامة",
              content:
                "تتنوع بين الاختلاس والرشوة والتزوير والكسب غير المشروع وغسل الأموال والاحتيال الإلكتروني وتهريب العملات. لكل صورة خصوصيتها في التحقيق والإثبات مما يستوجب تطوير بروتوكولات تحقيقية مخصصة لكل نوع على حدة.",
              image: mbhsimg
            },
          ]}
        />

        {/* المطلب الثاني */}
        <MatalbCard
          title="المطلب الثاني: أهمية التحريات في جرائم الأموال العامة"
          sections={[
            {
              title: "أولاً: أهداف التحريات",
              content:
                "تهدف إلى التثبت من وقوع الجريمة وتحديد هوية الجناة وتوثيق الأدلة تمهيداً لإحالة القضية للجهات القضائية المختصة. تسعى كذلك إلى رصد شبكات الجريمة المالية المنظمة وكشف قنوات التمويل والتدفقات غير المشروعة بين أطرافها.",
            },
            {
              title: "ثانياً: مراحل إجراء التحريات وجمع المعلومات",
              content:
                "تمر التحريات بمراحل متتالية: الرصد الأولي، ثم جمع المعلومات وتحليلها، فالتحقق منها، وأخيراً توثيقها في تقارير جنائية. وتنتهي هذه المراحل بعرض النتائج على النيابة العامة لاتخاذ قرار الاتهام أو الحفظ وفق ما تكشفه المعطيات.",
              video: tahary,
            },
            {
              title: "ثالثاً: أساليب التحري",
              content:
                "تشمل المراقبة الميدانية والتنصت المأذون به وتحليل الحسابات المصرفية وفحص العقود الحكومية والاستعانة بالمخبرين. تُكمَّل هذه الأساليب التقليدية بأدوات تكنولوجية متطورة تشمل التتبع الرقمي وتحليل البيانات الضخمة والذكاء الاصطناعي.",
            },
          ]}
        />

        {/* المطلب الثالث */}
        <MatalbCard
          title="المطلب الثالث: دور التكنولوجيا والذكاء الاصطناعي في التحري في جرائم الأموال العامة"
          sections={[
            {
              title:
                "أولاً: دور التكنولوجيا والذكاء الاصطناعي في جرائم الأموال العامة",
              content:
                "تُستخدم خوارزميات التعلم الآلي لرصد الشذوذ في المعاملات المالية وكشف محاولات غسل الأموال والاحتيال في الوقت الفعلي. تُسهم تقنيات البلوكتشين في تتبع التدفقات المالية الرقمية وتوثيق الأدلة في صورة سجلات لا يمكن التلاعب بها.",
            },
            {
              title:
                "ثانياً: كيفية استخدام التكنولوجيا والذكاء الاصطناعي في التحري",
              content:
                "يعتمد المحققون على منصات تحليل الشبكات المالية لتمثيل العلاقات بين الأطراف وكشف القنوات غير المشروعة بصرياً. تُستخدم برامج التعرف على النصوص والمستندات لفحص كميات ضخمة من الوثائق المحاسبية بحثاً عن مؤشرات التزوير.",
            },
            {
              title:
                "ثالثاً: نماذج لقضايا الأموال العامة وكيفية استخدام الذكاء الاصطناعي",
              content:
                "كشفت قضايا موثقة عالمياً أن الذكاء الاصطناعي نجح في رصد شبكات غسيل أموال بلغت قيمتها مليارات الدولارات. محلياً تُطبَّق تقنيات التحليل الجنائي الرقمي في فحص العقود الحكومية للكشف عن مؤشرات الفساد والتلاعب في المناقصات.",
            },
          ]}
        
        />
      </section>
    </div>
  );
}

export default Mubahith3;
