export const mubahithCards = [
  {
    title: "المبحث الأول: التعريف بجرائم الأموال العامة",
    content: [
      "غسل الأموال",
      "الرشوة واستغلال النفوذ",
      "الاختلاس والإضرار بالمال العام",
      "الكسب غير المشروع",
      "النقد والتهريب",
      "التزييف والتزوير",
      "الجرائم المصرفية المستحدثة",
    ],
  },
  {
    title: "المبحث الثاني: دور الإدارة العامة لمباحث الأموال العامة",
    content: [
      "نشأة الإدارة وإختصاصاتها",
      "دور الإدارة العامة في مكافحة جرائم الأموال العامة",
      "أمثلة عن جهود الإدارة العامة",
    ],
  },
  {
    title: "المبحث الثالث: كيفية إجراء التحريات وجمع المعلومات",
    content: [
      "ماهية جرائم الأموال العامة",
      "أهمية التحريات",
      "دور التكنولوجيا والذكاء الاصطناعي في التحري",
    ],
  },
  {
    title: "المبحث الرابع: إستعراض بعض القضايا المستحدثة",
    content: [
      "مفهوم الجرائم المالية والمصرفية الإلكترونية",
      "أسباب انتشار الإختلاسات المالية",
      "دور الدولة في نشر الوعي للمواطنين والتعاون بين الجهات الشرطية",
    ],
  },
];
